conf/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОплатыПоЗаказам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

conf/Documents/Оплата/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Пересчитать суммы?';" + " en = 'Recalculate amounts'"), Режим, 0);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗаказы

&НаКлиенте
Процедура ЗаказыЗаказПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Заказы.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Сумма = ПолучитьСуммуДокумента(СтрокаТабличнойЧасти.Заказ);
	
	ОбновитьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыСуммаПриИзменении(Элемент)
	
	ОбновитьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Заказы.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Курс = ОбщийМодульСервер.ПолучитьКурсВалюты(Объект.Валюта, Объект.Дата);
		
		Для каждого СтрокаТоваров Из Объект.Заказы Цикл
			СтрокаТоваров.Сумма = Окр(СтрокаТоваров.Сумма / Курс, 2, РежимОкругления.Окр15как20);
		КонецЦикла;
		
		ОбновитьСуммуДокумента();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСуммуДокумента(Заказ)
	
	Возврат Заказ.СуммаДокумента;
	
КонецФункции // ПолучитьСуммуДокумента()


#КонецОбласти
